{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d97bea16-bf9a-4b8d-ac8a-eb6ae9b5e246",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The file exists\n"
     ]
    }
   ],
   "source": [
    "# Download initial data\n",
    "\n",
    "import os\n",
    "import urllib.request\n",
    "import gzip\n",
    "import shutil\n",
    "\n",
    "url = 'https://storage.googleapis.com/gresearch/wit/wit_v1.train.all-1percent_sample.tsv.gz'\n",
    "filename = 'data/wit/data.tsv'\n",
    "\n",
    "if os.path.exists(filename):\n",
    "    print(\"The file exists\")\n",
    "\n",
    "else:\n",
    "    # Download the data from the URL\n",
    "    with urllib.request.urlopen(url) as response:\n",
    "      with open(filename + '.gz', 'wb') as f:\n",
    "        f.write(response.read())\n",
    "    \n",
    "    # Extract the data from the compressed file\n",
    "    with gzip.open(filename + '.gz', 'rb') as f_in:\n",
    "      with open(filename, 'wb') as f_out:\n",
    "        shutil.copyfileobj(f_in, f_out)\n",
    "\n",
    "    print(\"The file was downloaded\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "dbc3aa6a-73e9-43fe-90ac-9efac1e748a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Create table\n",
      "Copied data\n",
      "Completed\n"
     ]
    }
   ],
   "source": [
    "# Create Postgres table with initial data\n",
    "\n",
    "import os\n",
    "import psycopg2\n",
    "\n",
    "db_connection_string = os.environ.get('DATABASE_URL')\n",
    "with psycopg2.connect(db_connection_string) as conn:\n",
    "    with conn.cursor() as cursor:\n",
    "        with open('data/wit/create_table.sql', 'r') as sql_file:\n",
    "            sql_script = sql_file.read()\n",
    "        cursor.execute(sql_script)\n",
    "        print(\"Create table\")\n",
    "        \n",
    "        count_query = \"SELECT COUNT(*) FROM tsv_data\"\n",
    "        cursor.execute(count_query)\n",
    "        row_count = cursor.fetchone()[0]\n",
    "        \n",
    "        if row_count == 0:\n",
    "            with open('data/wit/copy_data.sql', 'r') as sql_file:\n",
    "                sql_script = sql_file.read()\n",
    "            cursor.execute(sql_script)\n",
    "            print(\"Copied data\")\n",
    "        else:\n",
    "            print(\"No need to copy data\")\n",
    "        \n",
    "        image_urls_query = \"SELECT id, image_url FROM tsv_data WHERE image_url_ai IS NULL LIMIT 10\"\n",
    "        cursor.execute(image_urls_query)\n",
    "        image_urls = cursor.fetchall()\n",
    "        \n",
    "        conn.commit()\n",
    "        print(\"Completed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "33f2d683-f7cd-428d-9aaa-e6336b1cb61c",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 500/500 [04:01<00:00,  2.07it/s]\n"
     ]
    }
   ],
   "source": [
    "# Process image data\n",
    "\n",
    "import asyncio\n",
    "import aiohttp\n",
    "import asyncpg\n",
    "import torch\n",
    "import clip\n",
    "import PIL\n",
    "import io\n",
    "import os\n",
    "import json\n",
    "from tqdm.asyncio import tqdm as async_tqdm\n",
    "import nest_asyncio\n",
    "\n",
    "device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n",
    "model, preprocess = clip.load('ViT-B/32', device)\n",
    "model.eval()\n",
    "model.to(device)\n",
    "\n",
    "BATCH_SIZE = 8\n",
    "\n",
    "async def process_batch(session, items):\n",
    "    images = []\n",
    "    ids = []\n",
    "    for item in items:\n",
    "        id, image_url = item\n",
    "        try:\n",
    "            req_headers = {'User-Agent': 'SelectImages/0.0 (narekg.me; ngalstjan4@gmail.com)'}\n",
    "            async with session.get(image_url, headers=req_headers) as response:\n",
    "                image_bytes = await response.read()\n",
    "                image = PIL.Image.open(io.BytesIO(image_bytes)).convert(\"RGB\")\n",
    "                images.append(image)\n",
    "                ids.append(id)\n",
    "        except Exception as e:\n",
    "            pass\n",
    "\n",
    "    if len(images) > 0:\n",
    "        preprocessed_images = torch.stack([preprocess(image) for image in images]).to(device)\n",
    "        with torch.no_grad():\n",
    "            image_embeddings = model.encode_image(preprocessed_images).tolist()\n",
    "        image_embeddings = [json.dumps(embedding) for embedding in image_embeddings]\n",
    "        return list(zip(image_embeddings, image_embeddings, ids))\n",
    "    else:\n",
    "        return None\n",
    "\n",
    "async def main():\n",
    "    db_connection_string = os.environ.get('DATABASE_URL')\n",
    "    conn = await asyncpg.connect(db_connection_string)\n",
    "    async with conn.transaction():\n",
    "        rows = await conn.fetch('''\n",
    "            SELECT\n",
    "                id,\n",
    "                image_url\n",
    "            FROM\n",
    "                tsv_data\n",
    "            WHERE\n",
    "                language = 'en'\n",
    "                AND image_url IS NOT NULL\n",
    "            ORDER BY\n",
    "                RANDOM()\n",
    "            LIMIT 500\n",
    "        ''')\n",
    "\n",
    "        async with aiohttp.ClientSession() as session:\n",
    "            results = []\n",
    "            batch = []\n",
    "            for item in async_tqdm(rows, total=len(rows)):\n",
    "                batch.append(item)\n",
    "                if len(batch) == BATCH_SIZE:\n",
    "                    batch_result = await process_batch(session, batch)\n",
    "                    if batch_result is not None:\n",
    "                        results.extend(batch_result)\n",
    "                    batch = []\n",
    "\n",
    "            # Process the last batch if it's not empty\n",
    "            if len(batch) > 0:\n",
    "                batch_result = await process_batch(session, batch)\n",
    "                if batch_result is not None:\n",
    "                    results.extend(batch_result)\n",
    "\n",
    "            # Execute the SQL update queries for the entire batch at once\n",
    "            update_query = \"UPDATE tsv_data SET image_url_ai1 = $1, image_url_ai2 = $2 WHERE id = $3\"\n",
    "            await conn.executemany(update_query, results)\n",
    "\n",
    "    await conn.close()\n",
    "\n",
    "nest_asyncio.apply()\n",
    "asyncio.run(main())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "1a980251-c7f2-4b71-a17a-650e774898eb",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 32/32 [03:10<00:00,  5.95s/it]\n"
     ]
    }
   ],
   "source": [
    "# Process text data\n",
    "\n",
    "import os\n",
    "import torch\n",
    "import asyncpg\n",
    "from tqdm import tqdm\n",
    "from transformers import DistilBertModel, DistilBertTokenizer\n",
    "import json\n",
    "\n",
    "device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n",
    "\n",
    "model_name = 'distilbert-base-uncased'\n",
    "model = DistilBertModel.from_pretrained(model_name)\n",
    "tokenizer = DistilBertTokenizer.from_pretrained(model_name)\n",
    "model.eval()\n",
    "model.to(device)\n",
    "\n",
    "def process_batch(batch):\n",
    "    # Unpack IDs and texts from the batch\n",
    "    ids, texts = zip(*batch)\n",
    "\n",
    "    inputs = tokenizer.batch_encode_plus(\n",
    "        texts,\n",
    "        add_special_tokens=True,\n",
    "        padding='longest',\n",
    "        truncation=True,\n",
    "        max_length=128,\n",
    "        return_tensors='pt'\n",
    "    )\n",
    "    inputs = {key: value.to(device) for key, value in inputs.items()}\n",
    "\n",
    "    with torch.no_grad():\n",
    "        outputs = model(**inputs)\n",
    "        text_embeddings = torch.mean(outputs.last_hidden_state, dim=1).tolist()\n",
    "\n",
    "    text_embeddings = [json.dumps(embedding) for embedding in text_embeddings]\n",
    "\n",
    "    return list(zip(text_embeddings, text_embeddings, ids))\n",
    "\n",
    "async def main():\n",
    "    db_connection_string = os.environ.get('DATABASE_URL')\n",
    "    conn = await asyncpg.connect(db_connection_string)\n",
    "    async with conn.transaction():\n",
    "        rows = await conn.fetch('''\n",
    "            SELECT\n",
    "                id,\n",
    "                context_page_description\n",
    "            FROM\n",
    "                tsv_data\n",
    "            WHERE\n",
    "                language = 'en'\n",
    "                AND context_page_description IS NOT NULL\n",
    "            ORDER BY\n",
    "                RANDOM()\n",
    "            LIMIT 1000\n",
    "        ''')\n",
    "        \n",
    "        batch_size = 32\n",
    "        results = []\n",
    "        for i in tqdm(range(0, len(rows), batch_size)):\n",
    "            batch = rows[i:i+batch_size]\n",
    "            batch_result = process_batch(batch)\n",
    "            results.extend(batch_result)\n",
    "\n",
    "        # Execute the SQL update queries for the entire batch at once\n",
    "        update_query = \"UPDATE tsv_data SET context_page_description_ai1 = $1, context_page_description_ai2 = $2 WHERE id = $3\"\n",
    "        await conn.executemany(update_query, results)\n",
    "\n",
    "    await conn.close()\n",
    "\n",
    "asyncio.run(main())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "da5ce55d-b7a2-4955-8734-3f98e3c08f6b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--------------------------------------------------\n",
      "image_url_ai (4000)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       23123.127 ops / s\n",
      "select id                      2359.492 ops / s\n",
      "select int                     1345.704 ops / s\n",
      "select int (indexed)           1367.314 ops / s\n",
      "select vector                  92.879 ops / s\n",
      "select vector (indexed)        972.457 ops / s\n",
      "--------------------------------------------------\n",
      "\n",
      "\n",
      "--------------------------------------------------\n",
      "image_url_ai (8000)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       7815.279 ops / s\n",
      "select id                      1443.345 ops / s\n",
      "select int                     544.462 ops / s\n",
      "select int (indexed)           8812.118 ops / s\n",
      "select vector                  46.807 ops / s\n",
      "select vector (indexed)        802.845 ops / s\n",
      "--------------------------------------------------\n",
      "\n",
      "\n",
      "--------------------------------------------------\n",
      "context_page_description_ai (4000)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       24964.609 ops / s\n",
      "select id                      2849.101 ops / s\n",
      "select int                     1551.986 ops / s\n",
      "select int (indexed)           9386.590 ops / s\n",
      "select vector                  77.014 ops / s\n",
      "select vector (indexed)        621.197 ops / s\n",
      "--------------------------------------------------\n",
      "\n",
      "\n",
      "--------------------------------------------------\n",
      "context_page_description_ai (8000)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       12814.469 ops / s\n",
      "select id                      1422.174 ops / s\n",
      "select int                     570.564 ops / s\n",
      "select int (indexed)           11448.274 ops / s\n",
      "select vector                  38.749 ops / s\n",
      "select vector (indexed)        583.404 ops / s\n",
      "--------------------------------------------------\n",
      "\n",
      "\n",
      "--------------------------------------------------\n",
      "context_page_description_ai (12000)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       11952.308 ops / s\n",
      "select id                      814.953 ops / s\n",
      "select int                     310.979 ops / s\n",
      "select int (indexed)           10715.062 ops / s\n",
      "select vector                  27.881 ops / s\n",
      "select vector (indexed)        522.850 ops / s\n",
      "--------------------------------------------------\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import time\n",
    "import numpy as np\n",
    "from pgvector.psycopg2 import register_vector\n",
    "import psycopg2\n",
    "\n",
    "db_connection_string = os.environ.get('DATABASE_URL')\n",
    "\n",
    "n_interval = 4000\n",
    "num_iterations = 100  # Increase the sample size\n",
    "warm_up_iterations = 10  # Number of iterations for warm-up\n",
    "\n",
    "def measure_throughput(label, query, generate_args=None):\n",
    "    with psycopg2.connect(db_connection_string) as conn:\n",
    "        register_vector(conn)\n",
    "        with conn.cursor() as cursor:\n",
    "            # Create table\n",
    "\n",
    "            # Helper for executing query\n",
    "            def execute_query():\n",
    "                if generate_args is not None:\n",
    "                    vector = generate_args()\n",
    "                    cursor.execute(query, (vector,))\n",
    "                else:\n",
    "                    cursor.execute(query)\n",
    "            \n",
    "            # Warm-up\n",
    "            for _ in range(warm_up_iterations):\n",
    "                execute_query()\n",
    "\n",
    "            # Measured\n",
    "            start_time = time.time()\n",
    "            for _ in range(num_iterations):\n",
    "                execute_query()\n",
    "            end_time = time.time()\n",
    "\n",
    "    elapsed_time = end_time - start_time\n",
    "    throughput = num_iterations / elapsed_time\n",
    "    print(f\"{label:<30} {throughput:.3f} ops / s\")\n",
    "\n",
    "def create_test_table(n, column):\n",
    "    with psycopg2.connect(db_connection_string) as conn:\n",
    "        with conn.cursor() as cursor:\n",
    "            cursor.execute(\"DROP TABLE IF EXISTS test_table\")\n",
    "            cursor.execute(f'''\n",
    "                CREATE TABLE test_table AS\n",
    "                SELECT * FROM tsv_data\n",
    "                WHERE {column}1 IS NOT NULL\n",
    "                LIMIT {n}\n",
    "            ''')\n",
    "            cursor.execute('CREATE INDEX ON test_table USING ivfflat (image_url_ai2 vector_l2_ops) WITH (lists = 100)')\n",
    "            cursor.execute('CREATE INDEX ON test_table USING ivfflat (context_page_description_ai2 vector_l2_ops) WITH (lists = 100)')\n",
    "            cursor.execute('CREATE INDEX ON test_table (original_width)')\n",
    "\n",
    "def drop_test_table():\n",
    "    with psycopg2.connect(db_connection_string) as conn:\n",
    "        with conn.cursor() as cursor:\n",
    "            cursor.execute(\"DROP TABLE IF EXISTS test_table\")\n",
    "\n",
    "def get_table_count(column):\n",
    "    with psycopg2.connect(db_connection_string) as conn:\n",
    "        with conn.cursor() as cursor:\n",
    "            cursor.execute(f\"SELECT COUNT(*) FROM tsv_data WHERE {column}1 IS NOT NULL\")\n",
    "            count = cursor.fetchone()[0]\n",
    "            return count\n",
    "\n",
    "def column_experiments(column, dimensions):\n",
    "    max_count = get_table_count(column)\n",
    "    start = n_interval\n",
    "    end = max_count - (max_count % n_interval) + 1\n",
    "    for count in range(start, end, n_interval):\n",
    "        create_test_table(count, column)\n",
    "        \n",
    "        print(\"\\n\" + (\"-\" * 50))\n",
    "        print(f\"{column} ({count})\")\n",
    "        print(\"-\" * 50)\n",
    "        \n",
    "        print(f\"{'query':<30} {'ops / s'}\")\n",
    "        print(\"-\" * 50)\n",
    "        \n",
    "        query = 'SELECT 1'\n",
    "        measure_throughput('select 1', query)\n",
    "        \n",
    "        query = f\"SELECT 1 FROM test_table WHERE id < 100\"\n",
    "        measure_throughput('select id', query)\n",
    "        \n",
    "        query = f\"SELECT 1 FROM test_table WHERE original_height < 100\"\n",
    "        measure_throughput('select int', query)\n",
    "    \n",
    "        query = f\"SELECT 1 FROM test_table WHERE original_width < 100\"\n",
    "        measure_throughput('select int (indexed)', query)\n",
    "        \n",
    "        query = f\"SELECT 1 FROM test_table ORDER BY {column}1 <-> %s LIMIT 10\"\n",
    "        measure_throughput('select vector', query, lambda: np.random.rand(dimensions))\n",
    "        \n",
    "        query = f\"SELECT * FROM test_table ORDER BY {column}2 <-> %s LIMIT 10\"\n",
    "        measure_throughput('select vector (indexed)', query, lambda: np.random.rand(dimensions))\n",
    "        print((\"-\" * 50) + \"\\n\")\n",
    "\n",
    "        drop_test_table()\n",
    "    \n",
    "column_experiments('image_url_ai', 512)\n",
    "column_experiments('context_page_description_ai', 768)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8b825267-c4d2-488a-a3c9-76156e0211a0",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.17"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
