{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d97bea16-bf9a-4b8d-ac8a-eb6ae9b5e246",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The file exists\n"
     ]
    }
   ],
   "source": [
    "# Download initial data\n",
    "\n",
    "import os\n",
    "import urllib.request\n",
    "import gzip\n",
    "import shutil\n",
    "\n",
    "url = 'https://storage.googleapis.com/gresearch/wit/wit_v1.train.all-1percent_sample.tsv.gz'\n",
    "filename = 'data/wit/data.tsv'\n",
    "\n",
    "if os.path.exists(filename):\n",
    "    print(\"The file exists\")\n",
    "\n",
    "else:\n",
    "    # Download the data from the URL\n",
    "    with urllib.request.urlopen(url) as response:\n",
    "      with open(filename + '.gz', 'wb') as f:\n",
    "        f.write(response.read())\n",
    "    \n",
    "    # Extract the data from the compressed file\n",
    "    with gzip.open(filename + '.gz', 'rb') as f_in:\n",
    "      with open(filename, 'wb') as f_out:\n",
    "        shutil.copyfileobj(f_in, f_out)\n",
    "\n",
    "    print(\"The file was downloaded\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "dbc3aa6a-73e9-43fe-90ac-9efac1e748a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Create table\n",
      "Copied data\n",
      "Completed\n"
     ]
    }
   ],
   "source": [
    "# Create Postgres table with initial data\n",
    "\n",
    "import os\n",
    "import psycopg2\n",
    "\n",
    "db_connection_string = os.environ.get('DATABASE_URL')\n",
    "with psycopg2.connect(db_connection_string) as conn:\n",
    "    with conn.cursor() as cursor:\n",
    "        with open('data/wit/create_table.sql', 'r') as sql_file:\n",
    "            sql_script = sql_file.read()\n",
    "        cursor.execute(sql_script)\n",
    "        print(\"Create table\")\n",
    "        \n",
    "        count_query = \"SELECT COUNT(*) FROM tsv_data\"\n",
    "        cursor.execute(count_query)\n",
    "        row_count = cursor.fetchone()[0]\n",
    "        \n",
    "        if row_count == 0:\n",
    "            with open('data/wit/copy_data.sql', 'r') as sql_file:\n",
    "                sql_script = sql_file.read()\n",
    "            cursor.execute(sql_script)\n",
    "            print(\"Copied data\")\n",
    "        else:\n",
    "            print(\"No need to copy data\")\n",
    "        \n",
    "        image_urls_query = \"SELECT id, image_url FROM tsv_data WHERE image_url_ai IS NULL LIMIT 10\"\n",
    "        cursor.execute(image_urls_query)\n",
    "        image_urls = cursor.fetchall()\n",
    "        \n",
    "        conn.commit()\n",
    "        print(\"Completed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "89300ae9-1a61-408d-9a1d-812f755051ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 1000/1000 [03:33<00:00,  4.68it/s]\n"
     ]
    }
   ],
   "source": [
    "import asyncio\n",
    "import aiohttp\n",
    "import psycopg2\n",
    "import torch\n",
    "import clip\n",
    "import PIL\n",
    "import io\n",
    "import os\n",
    "from tqdm import tqdm\n",
    "\n",
    "device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n",
    "model, preprocess = clip.load('ViT-B/32', device)\n",
    "model.eval()\n",
    "model.to(device)\n",
    "\n",
    "async def download_and_preprocess(session, item):\n",
    "    # Unpack the tuple\n",
    "    id, image_url = item\n",
    "\n",
    "    try:\n",
    "        # Download the image from the URL\n",
    "        req_headers = {'User-Agent': 'SelectImages/0.0 (narekg.me; ngalstjan4@gmail.com)'}\n",
    "        async with session.get(image_url, headers=req_headers) as response:\n",
    "            image_bytes = await response.read()\n",
    "            image = PIL.Image.open(io.BytesIO(image_bytes)).convert(\"RGB\")\n",
    "\n",
    "        # Preprocess the image and generate embeddings\n",
    "        preprocessed_image = preprocess(image).unsqueeze(0).to(device)\n",
    "        with torch.no_grad():\n",
    "            image_embedding = model.encode_image(preprocessed_image).squeeze().tolist()\n",
    "\n",
    "        return (image_embedding, image_embedding, id)\n",
    "    except Exception as e:\n",
    "        return None\n",
    "\n",
    "db_connection_string = os.environ.get('DATABASE_URL')\n",
    "with psycopg2.connect(db_connection_string) as conn:\n",
    "    with conn.cursor() as cursor:\n",
    "        cursor.execute('''\n",
    "            SELECT\n",
    "                id,\n",
    "                image_url\n",
    "            FROM\n",
    "                tsv_data\n",
    "            WHERE\n",
    "                language = 'en'\n",
    "                AND image_url IS NOT NULL\n",
    "            ORDER BY\n",
    "                RANDOM()\n",
    "            LIMIT 1000\n",
    "        ''')\n",
    "        rows = cursor.fetchall()\n",
    "\n",
    "\n",
    "\n",
    "        async with aiohttp.ClientSession() as session:\n",
    "            tasks = [download_and_preprocess(session, item) for item in rows]\n",
    "            for future in tqdm(asyncio.as_completed(tasks), total=len(tasks)):\n",
    "                result = await future\n",
    "                if result is not None:\n",
    "                    update_query = \"UPDATE tsv_data SET image_url_ai1 = %s, image_url_ai2 = %s WHERE id = %s\"\n",
    "                    cursor.execute(update_query, result)\n",
    "        \n",
    "        # Commit the changes to the database\n",
    "        conn.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "90f7e9b6-8f6b-4051-9f31-1f2aaef28630",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 63/63 [06:23<00:00,  6.09s/it]\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import logging\n",
    "import psycopg2\n",
    "import torch\n",
    "from tqdm import tqdm\n",
    "from transformers import DistilBertModel, DistilBertTokenizer\n",
    "\n",
    "logging.getLogger(\"transformers.modeling_utils\").setLevel(logging.ERROR)\n",
    "\n",
    "def process_batch(batch, model, tokenizer, device, cursor):\n",
    "    try:\n",
    "        # Unpack IDs and texts from the batch\n",
    "        ids, texts = zip(*batch)\n",
    "\n",
    "        inputs = tokenizer.batch_encode_plus(\n",
    "            texts,\n",
    "            add_special_tokens=True,\n",
    "            padding='longest',\n",
    "            truncation=True,\n",
    "            max_length=128,\n",
    "            return_tensors='pt'\n",
    "        )\n",
    "        inputs = {key: value.to(device) for key, value in inputs.items()}\n",
    "\n",
    "        with torch.no_grad():\n",
    "            outputs = model(**inputs)\n",
    "            text_embeddings = torch.mean(outputs.last_hidden_state, dim=1).tolist()\n",
    "\n",
    "        for id, text_embedding in zip(ids, text_embeddings):\n",
    "            query = \"UPDATE tsv_data SET context_page_description_ai1 = %s, context_page_description_ai2 = %s WHERE id = %s\"\n",
    "            cursor.execute(query, (text_embedding, text_embedding, id))\n",
    "\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "\n",
    "device = torch.device(\"cuda\" if torch.cuda.is_available() else \"cpu\")\n",
    "\n",
    "model_name = 'distilbert-base-uncased'\n",
    "model = DistilBertModel.from_pretrained(model_name)\n",
    "tokenizer = DistilBertTokenizer.from_pretrained(model_name)\n",
    "model.eval()\n",
    "model.to(device)\n",
    "\n",
    "db_connection_string = os.environ.get('DATABASE_URL')\n",
    "with psycopg2.connect(db_connection_string) as conn:\n",
    "    with conn.cursor() as cursor:\n",
    "        cursor.execute('''\n",
    "            SELECT\n",
    "                id,\n",
    "                context_page_description\n",
    "            FROM\n",
    "                tsv_data\n",
    "            WHERE\n",
    "                language = 'en'\n",
    "                AND context_page_description IS NOT NULL\n",
    "            ORDER BY\n",
    "                RANDOM()\n",
    "            LIMIT 2000\n",
    "        ''')\n",
    "        rows = cursor.fetchall()\n",
    "        \n",
    "        batch_size = 32\n",
    "        for i in tqdm(range(0, len(rows), batch_size)):\n",
    "            batch = rows[i:i+batch_size]\n",
    "            process_batch(batch, model, tokenizer, device, cursor)\n",
    "        \n",
    "        conn.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "da5ce55d-b7a2-4955-8734-3f98e3c08f6b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--------------------------------------------------\n",
      "image_url_ai (8635)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       11908.870 ops / s\n",
      "select id                      8267.897 ops / s\n",
      "select int                     3.911 ops / s\n",
      "select int (indexed)           10451.271 ops / s\n",
      "select vector                  3.458 ops / s\n",
      "select vector (indexed)        1026.883 ops / s\n",
      "--------------------------------------------------\n",
      "\n",
      "\n",
      "--------------------------------------------------\n",
      "context_page_description_ai (10051)\n",
      "--------------------------------------------------\n",
      "query                          ops / s\n",
      "--------------------------------------------------\n",
      "select 1                       12175.048 ops / s\n",
      "select id                      8099.614 ops / s\n",
      "select int                     3.806 ops / s\n",
      "select int (indexed)           10193.710 ops / s\n",
      "select vector                  3.178 ops / s\n",
      "select vector (indexed)        330.657 ops / s\n",
      "--------------------------------------------------\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import time\n",
    "import numpy as np\n",
    "from pgvector.psycopg2 import register_vector\n",
    "import psycopg2\n",
    "\n",
    "db_connection_string = os.environ.get('DATABASE_URL')\n",
    "\n",
    "num_iterations = 50  # Increase the sample size\n",
    "warm_up_iterations = 10  # Number of iterations for warm-up\n",
    "\n",
    "def measure_throughput(label, query, generate_args=None):\n",
    "    with psycopg2.connect(db_connection_string) as conn:\n",
    "        register_vector(conn)\n",
    "        with conn.cursor() as cursor:\n",
    "            def execute_query():\n",
    "                if generate_args is not None:\n",
    "                    vector = generate_args()\n",
    "                    cursor.execute(query, (vector,))\n",
    "                else:\n",
    "                    cursor.execute(query)\n",
    "            \n",
    "            # Warm-up\n",
    "            for _ in range(warm_up_iterations):\n",
    "                execute_query()\n",
    "\n",
    "            # Measured\n",
    "            start_time = time.time()\n",
    "            for _ in range(num_iterations):\n",
    "                execute_query()\n",
    "            end_time = time.time()\n",
    "\n",
    "    elapsed_time = end_time - start_time\n",
    "    throughput = num_iterations / elapsed_time\n",
    "    print(f\"{label:<30} {throughput:.3f} ops / s\")\n",
    "\n",
    "def column_experiments(column, dimensions):\n",
    "    with psycopg2.connect(db_connection_string) as conn:\n",
    "        with conn.cursor() as cursor:\n",
    "            cursor.execute(f\"select count(*) from tsv_data where {column}1 IS NOT NULL\")\n",
    "            count = cursor.fetchone()[0]\n",
    "\n",
    "    print(\"\\n\" + (\"-\" * 50))\n",
    "    print(f\"{column} ({count})\")\n",
    "    print(\"-\" * 50)\n",
    "    \n",
    "    print(f\"{'query':<30} {'ops / s'}\")\n",
    "    print(\"-\" * 50)\n",
    "    \n",
    "    query = 'SELECT 1'\n",
    "    measure_throughput('select 1', query)\n",
    "    \n",
    "    query = f\"SELECT 1 FROM tsv_data WHERE {column}1 IS NOT NULL AND id < 100\"\n",
    "    measure_throughput('select id', query)\n",
    "    \n",
    "    query = f\"SELECT 1 FROM tsv_data WHERE {column}1 IS NOT NULL AND original_height < 100\"\n",
    "    measure_throughput('select int', query)\n",
    "\n",
    "    query = f\"SELECT 1 FROM tsv_data WHERE {column}1 IS NOT NULL AND original_width < 100\"\n",
    "    measure_throughput('select int (indexed)', query)\n",
    "    \n",
    "    query = f\"SELECT * FROM tsv_data WHERE {column}1 IS NOT NULL ORDER BY {column}1 <-> %s LIMIT 10\"\n",
    "    measure_throughput('select vector', query, lambda: np.random.rand(dimensions))\n",
    "    \n",
    "    query = f\"SELECT * FROM tsv_data WHERE {column}2 IS NOT NULL ORDER BY {column}2 <-> %s LIMIT 10\"\n",
    "    measure_throughput('select vector (indexed)', query, lambda: np.random.rand(dimensions))\n",
    "    print((\"-\" * 50) + \"\\n\")\n",
    "\n",
    "column_experiments('image_url_ai', 512)\n",
    "column_experiments('context_page_description_ai', 768)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8b825267-c4d2-488a-a3c9-76156e0211a0",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.17"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
